import React from 'react';
import cl from './Order.module.css'
import {useNavigate} from "react-router-dom";
import {BlockText} from "../../components/BlockText/BlockText";
import {BottomButton} from "../../components/BottomButton/BottomButton";
import {ItemProduct} from "../../components/ItemProduct/ItemProduct";

export const Order = () => {
    const navigate = useNavigate()

    return (
        <div className={cl.wrapperOrder}>
            <div className={cl.ordersBack} onClick={() => navigate('/orders')}>
                <svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M2.86395 8.49998L8.52528 2.68198C8.5719 2.63509 8.60874 2.57943 8.6337 2.51821C8.65866 2.45699 8.67122 2.39142 8.67068 2.32531C8.67013 2.2592 8.65647 2.19386 8.6305 2.13306C8.60453 2.07226 8.56676 2.01722 8.51938 1.97111C8.472 1.92501 8.41594 1.88876 8.35445 1.86446C8.29297 1.84016 8.22727 1.8283 8.16117 1.82956C8.09507 1.83082 8.02988 1.84517 7.96936 1.87179C7.90885 1.89841 7.85421 1.93677 7.80862 1.98465L1.80862 8.15131C1.7178 8.24466 1.66699 8.36975 1.66699 8.49998C1.66699 8.63021 1.7178 8.7553 1.80862 8.84865L7.80862 15.0153C7.85421 15.0632 7.90885 15.1015 7.96936 15.1282C8.02988 15.1548 8.09507 15.1691 8.16117 15.1704C8.22727 15.1717 8.29297 15.1598 8.35445 15.1355C8.41594 15.1112 8.472 15.075 8.51938 15.0288C8.56676 14.9827 8.60453 14.9277 8.6305 14.8669C8.65647 14.8061 8.67013 14.7408 8.67068 14.6746C8.67122 14.6085 8.65866 14.543 8.6337 14.4818C8.60874 14.4205 8.5719 14.3649 8.52528 14.318L2.86395 8.49998Z"
                        fill="black"/>
                </svg>
                <h4>Заказ</h4>
            </div>
            <div className={cl.detailsOrder}>

                <div className={cl.iconBlock}>
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M6.99967 13.6667C3.31767 13.6667 0.333008 10.682 0.333008 7.00004C0.333008 3.31804 3.31767 0.333374 6.99967 0.333374C10.6817 0.333374 13.6663 3.31804 13.6663 7.00004C13.6663 10.682 10.6817 13.6667 6.99967 13.6667ZM6.99967 12.3334C8.41416 12.3334 9.77072 11.7715 10.7709 10.7713C11.7711 9.77108 12.333 8.41453 12.333 7.00004C12.333 5.58555 11.7711 4.229 10.7709 3.2288C9.77072 2.22861 8.41416 1.66671 6.99967 1.66671C5.58519 1.66671 4.22863 2.22861 3.22844 3.2288C2.22824 4.229 1.66634 5.58555 1.66634 7.00004C1.66634 8.41453 2.22824 9.77108 3.22844 10.7713C4.22863 11.7715 5.58519 12.3334 6.99967 12.3334ZM7.66634 7.00004H10.333V8.33337H6.33301V3.66671H7.66634V7.00004Z"
                            fill="#037EE5"/>
                    </svg>
                    <div className={cl.blockText}>
                        <BlockText firstTitle={'Время заказа:'} secondTitle={'16 марта, 18:00'}/>
                        <BlockText firstTitle={'Дата получения:'} secondTitle={'18 марта, 18:00'}/>
                    </div>
                </div>

                <div className={cl.iconBlock}>
                    <svg width="12" height="14" viewBox="0 0 12 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M6.00033 7.00004C5.26699 7.00004 4.66699 6.40004 4.66699 5.66671C4.66699 4.93337 5.26699 4.33337 6.00033 4.33337C6.73366 4.33337 7.33366 4.93337 7.33366 5.66671C7.33366 6.40004 6.73366 7.00004 6.00033 7.00004ZM10.0003 5.80004C10.0003 3.38004 8.23366 1.66671 6.00033 1.66671C3.76699 1.66671 2.00033 3.38004 2.00033 5.80004C2.00033 7.36004 3.30033 9.42671 6.00033 11.8934C8.70033 9.42671 10.0003 7.36004 10.0003 5.80004ZM6.00033 0.333374C8.80033 0.333374 11.3337 2.48004 11.3337 5.80004C11.3337 8.01337 9.55366 10.6334 6.00033 13.6667C2.44699 10.6334 0.666992 8.01337 0.666992 5.80004C0.666992 2.48004 3.20033 0.333374 6.00033 0.333374Z"
                            fill="#037EE5"/>
                    </svg>
                    <div className={cl.blockText}>
                        <BlockText firstTitle={'Адрес доставки:'} secondTitle={'ул.Сибгатуллина д.17 кв.23'}/>
                    </div>
                </div>


                <div className={cl.iconBlock}>
                    <svg width="14" height="12" viewBox="0 0 14 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M0 9.75C0 10.2141 0.184374 10.6592 0.512563 10.9874C0.840752 11.3156 1.28587 11.5 1.75 11.5H12.25C12.7141 11.5 13.1592 11.3156 13.4874 10.9874C13.8156 10.6592 14 10.2141 14 9.75V4.9375H0V9.75ZM2.0625 7.375C2.0625 7.12636 2.16127 6.8879 2.33709 6.71209C2.5129 6.53627 2.75136 6.4375 3 6.4375H4.5C4.74864 6.4375 4.9871 6.53627 5.16291 6.71209C5.33873 6.8879 5.4375 7.12636 5.4375 7.375V8C5.4375 8.24864 5.33873 8.4871 5.16291 8.66291C4.9871 8.83873 4.74864 8.9375 4.5 8.9375H3C2.75136 8.9375 2.5129 8.83873 2.33709 8.66291C2.16127 8.4871 2.0625 8.24864 2.0625 8V7.375ZM12.25 0.5H1.75C1.28587 0.5 0.840752 0.684375 0.512563 1.01256C0.184374 1.34075 0 1.78587 0 2.25V3.0625H14V2.25C14 1.78587 13.8156 1.34075 13.4874 1.01256C13.1592 0.684375 12.7141 0.5 12.25 0.5Z"
                            fill="#037EE5"/>
                    </svg>

                    <div className={cl.blockText}>
                        <BlockText firstTitle={'Способ оплаты:'} secondTitle={'оффлайн оплата'}/>
                    </div>
                </div>

            </div>
            <BottomButton text={'Повторить заказ'} link={'/'}/>
            <hr className={cl.customHR}/>
            <div className={cl.productsOrder}>
                <span>Детали заказы</span>
                <ItemProduct text={'Женские кроссовки STREETBEAT Shady'} price={'9 499'} size={'37'}/>
                <ItemProduct text={'Женские кроссовки STREETBEAT Shady'} price={'9 499'} size={'37'}/>
            </div>
            <div className={cl.sumPrice}>
                <hr className={cl.customHR}/>
                <div className={cl.total}>
                    <span className={cl.title}>Итого:</span>
                    <span className={cl.price}>18 998 ₽</span>
                </div>
            </div>
        </div>
    );
};

